import numpy as np
# Task 1
# Введіть з клавіатури в масив п'ять цілочисельних значень. Виведіть їх в один рядок через кому.
# Отримайте для масиву середнє арифметичне.
x = (input("Введіть з клавіатури в масив п'ять цілочисельних значень через пробіл: ").split())
for (i, u) in zip(x, range(0, len(x))):
    x[u] = int(i)
print(str(x)[1:-1:])
print(f"Середнє арифмитичне: {np.average(x)}")

# Task 2
# Введіть з клавіатури п'ять цілочисельних елементів масиву X.
# Виведіть на екран значення коренів і квадратів кожного з елементів масиву.
x = (input("Введіть з клавіатури в масив п'ять цілочисельних значень через пробіл: ").split())
for (i, u) in zip(x, range(0, len(x))):
    x[u] = int(i)
for (i,u) in zip(x, range(1,len(x)+1)):
    print(f"{u} елемент. Квадрат: {i**2}", end=".")
    if i >= 0:
        print(f" Корінь: {i ** 0.5}.")
    else:
        print(f" Елемент меньше 0, тому кореня немає.")

# Task 3
# Створіть масив з п'яти прізвищ і виведіть їх на екран стовпчиком, починаючи з останнього.
x = np.array(["Шевченко","Лаврін","Чурай","Бодько","Стефаник"])
for i in x[::-1]:
    print(i)

# Task 4
# Створіть масив з п'яти прізвищ і виведіть на екран ті, які починаються з певної букви, яка вводиться з клавіатури.
x = np.array(["Шевченко","Лаврін","Чурай","Шабленко","Стефаник"])
y = input("Введіть літеру (ш/л/ч/б/с): ")
c = 5
for i in x:
    if y == i.lower()[0]:
        print(i)
        c = 1
if c == 5:
    print("У масиві немає прізвищ, що починається з такої літери.")

# Task 5
# Створіть масив А [0..7] за допомогою генератора випадкових чисел і виведіть його на екран.
# Збільште всі його елементи в 2 рази.
x = np.random.randint(0, 7, 7)
print(x)
x = x*2
print(x)
