import datetime
# а) Дана послідовність цілих чисел а1, ..., аn. Для кожного з чисел, що входять в послідовність а1, ..., аn з'ясувати,
# скільки разів воно входить в цю послідовність. Результат представити у вигляді ряду рядків, перший з яких є а1 - k,
# де k - число входжень а1 в послідовність а1, ..., аn. Другий рядок буде мати вигляд аj - m, де аj - перший по порядку
# член послідовності, відмінний від а1, а m - число входжень цього члена в послідовність.

an = [1, 2, 3, 4, 5, 5, 1, 1, 4, 4, 5, 2, 5, 1]
count = 0
while an != []:
    for i in an:
        print(f'{i} - {an.count(i)}')
        for a in range(an.count(i)):
            an.remove(i)
        break

# б) Задача. Визначити кількість товарів, які продані менш ніж рік тому і вивести відомості про них. Поля структури:
# Продавець, Найменування товару, Кількість, Ціна, Дата продажу. Завдання у пункті б) необхідно виконувати,
# використовуючи типи даних dict та list.

dictionary = {"Максим": ["Апельсини", 200, 15, datetime.date(2020, 12, 20)], "Олег": ["Яблука", 350, 10,
              datetime.date(2021, 1, 25)], "Михайло": ["Груші", 275, 17, datetime.date(2021, 9, 20)],
              "Микола": ["Виноград", 200, 30, datetime.date(2020, 5, 12)]}

today = datetime.date(2021, 12, 3)
year_ago = today - datetime.timedelta(365)
counter = 0
amount = 0
profit = 0
for i, u in dictionary.items():
    if u[3] > year_ago:
        print(f'{i}: ', end="")
        counter = 0
        for a in u:
            if counter < 3:
                print(a, end=", ")
                counter += 1
            else:
                print(a)
        amount += u[1]
        profit = profit + u[1] * u[2]
print(f'Total sales: {amount}. \nTotal profit: {profit}.')
